Riktastic/Neo2Buddy/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Olimex ESP32-S3-DevKit-Lipo: 8 MB flash, NimBLE + Wi-Fi coexistence.
# CH340 UART has no reliable auto-reset; use BUT1+RST1 before flashing.
CONFIG_ESPTOOLPY_BEFORE_NORESET=y

CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
# Persist BLE bonds / CCCDs across reboot so a paired phone reconnects.
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_MAX_BONDS=3
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y

# SSD1306 OLED driver uses the legacy I2C driver API.
CONFIG_I2C_ENABLE_LEGACY_DRIVER=y

# Neo2 Buddy feature toggles (see main/Kconfig).
CONFIG_SUPPORT_BATTERY=y
CONFIG_SUPPORT_SDCARD=y
CONFIG_SUPPORT_OLED=y
CONFIG_BUDDY_UART_CMD=y

# Mobile browsers send large Cookie/User-Agent headers on captive portal join.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024
CONFIG_HTTPD_PURGE_BUF_LEN=128
CONFIG_LWIP_MAX_SOCKETS=16

# app_main runs SPIFFS, self-test, then spawns startup_task; BLE/Wi-Fi/HTTP need depth.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Lower peak Wi-Fi TX power to reduce USB brownout resets during STA auth.
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=15
CONFIG_ESP_PHY_REDUCE_TX_POWER=y

# Wi-Fi/IP events run on sys_evt; keep handlers minimal and give the task headroom.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# USB host (Neo2 OTG) shares the internal USB PHY with USB Serial/JTAG — disable
# secondary console on USJ so host mode can take the PHY without conflict.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set

# Neo2 USB connect can be slow / flaky — give enumeration more time.
CONFIG_USB_HOST_DEBOUNCE_DELAY_MS=500
CONFIG_USB_HOST_RESET_RECOVERY_MS=100
CONFIG_USB_HOST_SET_ADDR_RECOVERY_MS=50
